<!-- add-pr-comment:lambda-api_plan -->

# staging/lambda-api Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # data.aws_iam_policy_document.ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
            ]
          + sid       = "AllowPushPull"
        }
      + statement {
          + actions   = [
              + "lambda:GetAlias",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:ListAliases",
              + "lambda:ListVersionsByFunction",
              + "lambda:PublishVersion",
              + "lambda:UpdateAlias",
              + "lambda:UpdateFunctionCode",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
            ]
          + sid       = "PermissionsToUpdateFunction"
        }
      + statement {
          + actions   = [
              + "lambda:GetLayerVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
            ]
          + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
        }
    }
  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
        name             = "ecr-api-lambda-access"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:UpdateAlias",
                          - "lambda:PublishVersion",
                          - "lambda:ListVersionsByFunction",
                          - "lambda:ListAliases",
                          - "lambda:GetFunctionConfiguration",
                          - "lambda:GetFunction",
                          - "lambda:GetAlias",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                  - {
                      - Action   = "lambda:GetLayerVersion"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
                      - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }
  # aws_lambda_alias.api_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_latest" {
      ~ function_version = "1868" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
        name             = "latest"
        # (5 unchanged attributes hidden)
    }
  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1868" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1868/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1868" -> (known after apply)
        # (27 unchanged attributes hidden)
      ~ environment {
          ~ variables = {
              ~ "ENABLE_NEW_RELIC"               = "true" -> "false"
                # (15 unchanged elements hidden)
            }
        }
        # (4 unchanged blocks hidden)
    }
  # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
-/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
      ~ id       = "2999976209178516129" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-10-30T17:43:20Z" -> (known after apply)
        }
    }
Plan: 1 to add, 3 to change, 1 to destroy.

# --- End of Plan 1 ---